<a href="https://colab.research.google.com/github/hooda3789/Kaggle-Titanic-Challenge/blob/main/Titanic_Survival_Prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Titanic Survival Prediction

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import tensorflow as tf
from sklearn import linear_model
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier

In [ ]:
train = pd.read_csv('/content/train.csv')
test = pd.read_csv('/content/test.csv')

In [ ]:
train.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [ ]:
train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
train.describe(include=['O'])

                     Name   Sex  Ticket    Cabin Embarked
count                 891   891     891      204      889
unique                891     2     681      147        3
top     Hold, Mr. Stephen  male  347082  B96 B98        S
freq                    1   577       7        4      644

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
train.columns.values

array(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype=object)

In [ ]:
train = train.drop(['Cabin'], axis = 1)
test = test.drop(['Cabin'], axis = 1)

In [ ]:
train['Age'].fillna(train['Age'].mean(), inplace = True)
train['Age'] = train['Age'].astype('int64')

test['Age'].fillna(test['Age'].mean(), inplace = True)
test['Age'] = test['Age'].astype('int64')

In [ ]:
train['Embarked'].fillna(train['Embarked'].value_counts().index[0], inplace = True)
test['Embarked'].fillna(test['Embarked'].value_counts().index[0], inplace = True)

In [ ]:
train['Fare'] = train['Fare'].astype('int64')
test['Fare'].fillna(0, inplace = True)
test['Fare'] = test['Fare'].astype('int64')

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    int64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    int64
 10  Embarked     891 non-null    object
dtypes: int64(7), object(4)
memory usage: 76.7+ KB

In [ ]:
train = train.drop('Name', axis = 1)
test = test.drop('Name', axis = 1)

In [ ]:
genders = {"male" : 0, "female" : 1}
data = [train, test]

for dataset in data:
  dataset['Sex'] = dataset['Sex'].map(genders)

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          891 non-null    int64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    int64
 9   Embarked     891 non-null    object
dtypes: int64(8), object(2)
memory usage: 69.7+ KB

In [ ]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    int64
 3   Age          418 non-null    int64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Ticket       418 non-null    object
 7   Fare         418 non-null    int64
 8   Embarked     418 non-null    object
dtypes: int64(7), object(2)
memory usage: 29.5+ KB

In [ ]:
train = train.drop(['Ticket'], axis = 1)
test = test.drop(['Ticket'], axis = 1)

In [ ]:
emb = {"S" : 0, "C" : 1, "Q" : 2}
data = [train, test]

for dataset in data:
  dataset['Embarked'] = dataset['Embarked'].map(emb)

In [ ]:
PassengerId = test['PassengerId']
train = train.drop(['PassengerId'], axis = 1)
test = test.drop(['PassengerId'], axis = 1)

In [ ]:
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked
0         0       3    0   22      1      0     7         0
1         1       1    1   38      1      0    71         1
2         1       3    1   26      0      0     7         0
3         1       1    1   35      1      0    53         0
4         0       3    0   35      0      0     8         0

In [ ]:
test.head()

   Pclass  Sex  Age  SibSp  Parch  Fare  Embarked
0       3    0   34      0      0     7         2
1       3    1   47      1      0     7         0
2       2    0   62      0      0     9         2
3       3    0   27      0      0     8         0
4       3    1   22      1      1    12         0

In [ ]:
X_train = train.drop("Survived", axis = 1)
Y_train = train["Survived"]

X_test = test.copy()

In [ ]:
logreg = LogisticRegression()
logreg.fit(X_train, Y_train)

Y_pred = logreg.predict(X_test)

acc_log = round(logreg.score(X_train, Y_train)*100, 2)

In [ ]:
print(acc_log)

80.25

In [ ]:
my_submission = pd.DataFrame({"PassengerId" : PassengerId ,'Survived': Y_pred})
my_submission.to_csv('submission.csv', index=False)